#+TITLE: Poisson GLM (Ch 22)
#+AUTHOR: STAT X12, Spring 2026
#+OPTIONS: toc:t num:nil
#+PROPERTY: header-args:R :session poisson-glm :results output :dir .

** Deviance GOF Test

Informal assessment of adequacy of model fit (same as Binomial GLM). \(H_0\): model is adequate vs. \(H_a\): model is inadequate.

- Deviance stat = Residual deviance, follows \(\sim \chi^2_{n-p}\) under \(H_0\)

#+begin_quote
*Caution:* This test is not trustworthy when Poisson means are small (< 5).
#+end_quote

Should we trust the \(\chi^2_{38}\) distribution as a reasonable approximation for the null distribution in this case?

#+begin_src R
fitted(fit_quad)
#+end_src

#+RESULTS:
#+begin_example
       1        2        3        4        5        6        7        8
1.205366 1.317143 1.317143 1.317143 1.317143 1.436813 1.436813 1.436813
       9       10       11       12       13       14       15       16
1.436813 1.436813 1.436813 1.564664 1.845963 1.999881 1.999881 1.999881
      17       18       19       20       21       22       23       24
1.999881 1.999881 2.162911 2.162911 2.162911 2.162911 2.516912 2.516912
      25       26       27       28       29       30       31       32
2.708089 2.708089 2.708089 2.908783 3.118983 3.567606 3.805739 4.052794
      33       34       35       36       37       38       39       40
4.052794 4.052794 4.052794 4.052794 4.308474 4.572418 5.123315 5.409210
      41
6.606923
#+end_example

[FILL IN: Are the fitted Poisson means large enough (> 5) to trust the \(\chi^2_{38}\) approximation?]

Generally, what does a large p-value from an omnibus GOF test mean? [FILL IN]

** Back to the RQ

Do males have diminished success after some optimal age?

#+begin_src R
round(summary(fit_quad)$coef, digits = 4)
#+end_src

#+RESULTS:
#+begin_example
              Estimate Std. Error z value Pr(>|z|)
(Intercept)     0.8759     0.1060  8.2647   0.0000
poly(Age, 2)1   2.9690     0.6375  4.6570   0.0000
poly(Age, 2)2  -0.2347     0.5495 -0.4271   0.6693
#+end_example

[FILL IN: Interpret the quadratic term result and state conclusion about diminished success]

** Refine Model

What is the relationship between mating success and age?

#+begin_src R
fit_linear <- glm(Matings ~ Age, data = case2201, family = "poisson")
summary(fit_linear)
#+end_src

#+RESULTS:
#+begin_example
Call:
glm(formula = Matings ~ Age, family = "poisson", data = case2201)

Coefficients:
            Estimate Std. Error z value Pr(>|z|)
(Intercept) -1.58201    0.54462  -2.905  0.00368
Age          0.06869    0.01375   4.997 5.81e-07

(Dispersion parameter for poisson family taken to be 1)

    Null deviance: 75.372  on 40  degrees of freedom
Residual deviance: 51.012  on 39  degrees of freedom
AIC: 156.46

Number of Fisher Scoring iterations: 5
#+end_example

** Overdispersion Estimate

From =fit_quad=:

#+begin_example
Residual deviance: 50.826  on 38  degrees of freedom
#+end_example

\(\hat{\psi} =\) [FILL IN]

#+begin_src R
sum_pearson2 <- sum(resid(fit_quad, type = "pearson")^2)
psi_hat_star <- sum_pearson2/38
psi_hat_star
#+end_src

#+RESULTS:
#+begin_example
[1] 1.175194
#+end_example

\(\hat{\psi}^* = 1.175\)

